tap "homebrew/cask"
tap "aws/tap"
tap "homebrew/cask-fonts"
tap "AdoptOpenJDK/openjdk"
tap "browsh-org/homebrew-browsh"

brew "autoconf"
brew "libevent"
brew "readline"
brew "oniguruma"
brew "tmux"
brew "openssl"
brew "wget"
brew "tig"
brew "mecab"
brew "mecab-ipadic"
brew "httpie"
brew "slackcat"
brew "lua"
brew "luajit"
brew "m-cli"
brew "imagemagick"
brew "awscli"
brew "aws-sam-cli"
brew "cloudformation-cli"
brew "bat"
brew "antiword"
brew "shellcheck"
brew "bashdb"
brew "terraform"
brew "yarn"
brew "CocoaPods"
brew "entr"
brew "pipenv"
brew "circleci"
brew "ripgrep"
brew "cmake"
brew "neovim"
brew "azure-cli"
brew "websocat"
brew "opencv"
brew "scipy"
brew "fzf"
brew "tree"
brew "gradle"
brew "pkg-config"
brew "packer"
brew "jq"
brew "cunit"
brew "mas"
brew "git"
brew "nodebrew"
brew "pyenv"
brew "deno"
brew "zplug"
brew "universal-ctags"
brew "lazygit"
brew "graphviz"
brew "efm-langserver"
brew "go"
brew "colordiff"
brew "shfmt"
brew "stylua"
brew "gotop"
brew "gh"

cask "vlc"
cask "vagrant"
cask "iterm2"
cask "gimp"
cask "slack"
cask "evernote"
cask "visual-studio-code"
cask "google-cloud-sdk"
cask "google-chrome"
cask "dotnet-sdk"
cask "powershell"
cask "karabiner-elements"
cask "zoom"
cask "miro"
cask "docker"
cask "discord"
cask "google-japanese-ime"
cask "kindle"
cask "mockoon"
cask "nosql-workbench"
cask "microsoft-edge"
cask "blender"
cask "font-noto-sans-cjk-jp"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-hackgen-nerd"
cask "fliqlo"
cask "intellij-idea-ce"
cask "the-unarchiver"

#mas "Xcode", id: 497799835
#mas "Hex Fiend", id: 1342896380
